app/controllers/events_controller.rb

  def index
    @event = current_user.events.new
    @events = current_user.events.order('created_at DESC')
---
SELECT "events".* FROM "events" WHERE "events"."user_id" = $1 ORDER BY created_at DESC  [["user_id", 1]]

  def create
    @event = current_user.events.create(event_params)
---
INSERT INTO "events" ("name", "category", "place", "address", "start_date", "end_date", "assist_type", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def destroy
    current_user.events.destroy(params[:id])
---
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 14]]

  def update
    @event = current_user.events.find(params[:id])
    status = @event.update_attributes(event_params)
---
SELECT  "events".* FROM "events" WHERE "events"."user_id" = $1 AND "events"."id" = $2 LIMIT $3  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "events" SET "name" = $1, "category" = $2, "place" = $3, "address" = $4, "assist_type" = $5, "updated_at" = $6 WHERE "events"."id" = $7  [["name", "sdfsdsdf"], ["category", 3], ["place", "a"], ["address", "sdd"], ["assist_type", 1], ["updated_at", "2019-01-25 01:36:15.648578"], ["id", 21]]